#### BuiltInFailures.SheetFailures Members

---

|  |
| --- |
| BuiltInFailures SheetFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures SheetFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | SheetNumberDuplicated | Sheet Number is already in use. Enter a unique number. |
| Public property Static member | SheetNumberEmpty | Sheet Number is empty |

# See Also

BuiltInFailures SheetFailures Class

Autodesk.Revit.DB Namespace